---
kind: type
id: T:Autodesk.Revit.DB.Visual.Speckle
source: html/7363bccc-b6cc-7061-5cfa-ce1be2e00b38.htm
---
# Autodesk.Revit.DB.Visual.Speckle

A static class that provides access to the property names that appear in the Speckle visual asset schema.

## Syntax (C#)
```csharp
public static class Speckle
```